CSI API ETABS v1
cDesignForces.PierDesignForces Method
 Retrieves design forces for an existing designed pier
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int PierDesignForces(
	string InputPierLabel,
	string InputStoryName,
	ref int NumberResults,
	ref string[] Story,
	ref string[] PierLabel,
	ref string[] ComboName,
	ref string[] Location,
	ref double[] P,
	ref double[] V2,
	ref double[] V3,
	ref double[] T,
	ref double[] M2,
	ref double[] M3
)
Function PierDesignForces (
	InputPierLabel As String,
	InputStoryName As String,
	ByRef NumberResults As Integer,
	ByRef Story As String(),
	ByRef PierLabel As String(),
	ByRef ComboName As String(),
	ByRef Location As String(),
	ByRef P As Double(),
	ByRef V2 As Double(),
	ByRef V3 As Double(),
	ByRef T As Double(),
	ByRef M2 As Double(),
	ByRef M3 As Double()
) As Integer
Dim instance As cDesignForces
Dim InputPierLabel As String
Dim InputStoryName As String
Dim NumberResults As Integer
Dim Story As String()
Dim PierLabel As String()
Dim ComboName As String()
Dim Location As String()
Dim P As Double()
Dim V2 As Double()
Dim V3 As Double()
Dim T As Double()
Dim M2 As Double()
Dim M3 As Double()
Dim returnValue As Integer
returnValue = instance.PierDesignForces(InputPierLabel,
	InputStoryName, NumberResults, Story,
	PierLabel, ComboName, Location, P,
	V2, V3, T, M2, M3)
int PierDesignForces(
	String^ InputPierLabel,
	String^ InputStoryName,
	int% NumberResults,
	array<String^>^% Story,
	array<String^>^% PierLabel,
	array<String^>^% ComboName,
	array<String^>^% Location,
	array<double>^% P,
	array<double>^% V2,
	array<double>^% V3,
	array<double>^% T,
	array<double>^% M2,
	array<double>^% M3
)
abstract PierDesignForces :
        InputPierLabel : string *
        InputStoryName : string *
        NumberResults : int byref *
        Story : string[] byref *
        PierLabel : string[] byref *
        ComboName : string[] byref *
        Location : string[] byref *
        P : float[] byref *
        V2 : float[] byref *
        V3 : float[] byref *
        T : float[] byref *
        M2 : float[] byref *
        M3 : float[] byref -> int
Parameters
InputPierLabel
Type: System.String
 The name of an existing pier label on the story specified by InputStoryName. If this is left blank, results will be retrieved for all pier labels on the story.
InputStoryName
Type: System.String
 The name of an existing story for which to retrieve pier design forces. If this is left blank, results will be retrieved for all stories.
NumberResults
Type: System.Int32
 The number of results, this is the length of all output arrays
Story
Type: System.String[]
 The story at which the pier exists
PierLabel
Type: System.String[]
 The label of the pier
ComboName
Type: System.String[]
 The load combination for which the results are reported
Location
Type: System.String[]
 The location where the results are reported
P
Type: System.Double[]
 The design axial force in the pier object local 1-axis direction [F]
V2
Type: System.Double[]
 The design shear force in the pier object local 2-axis direction [F]
V3
Type: System.Double[]
 The design shear force in the pier object local 3-axis direction [F]
T
Type: System.Double[]
 The design torsional moment about the pier object local 1-axis [FL]
M2
Type: System.Double[]
 The design bending moment about the pier object local 2-axis [FL]
M3
Type: System.Double[]
 The design bending moment about the pier object local 3-axis [FL]
Return Value
Type: Int32
 Returns zero if the results are successfully retrieved, otherwise it returns a nonzero value.
Remarks
 To retrieve results for all pier labels on all stories, leave both InputPierLabel and InputStoryName blank.
See Also
Reference
cDesignForces Interface
ETABSv1 Namespace